Tekla Open API Reference for Tekla Structures 2025
Point Constructor (Double, Double, Double)
 Instantiates a point with the given coordinates.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point(
	double X,
	double Y,
	double Z
)
Public Sub New (
	X As Double,
	Y As Double,
	Z As Double
)
Parameters
X
Type: System.Double
The X-coordinate to be used.
Y
Type: System.Double
The Y-coordinate to be used.
Z
Type: System.Double
The Z-coordinate to be used.
See Also
Reference
Point Class
Point Overload
Tekla.Structures.Geometry3d Namespace